<!-- placeholder-1 -->
```fish
tofu plan -chdir=terraform
```
<!-- placeholder-2 -->

<details><summary>Diff of 9 changes.</summary>

```diff
~ data.aws_iam_policy_document.administration will be read during apply
# (config refers to values not yet known)
~ data.aws_iam_policy_document.combined will be read during apply
# (config refers to values not yet known)
~ data.aws_iam_policy_document.deny_insecure_transport will be read during apply
# (config refers to values not yet known)
~ data.aws_iam_policy_document.require_latest_tls will be read during apply
# (config refers to values not yet known)
+ aws_s3_bucket.this will be created
+ aws_s3_bucket_ownership_controls.this will be created
+ aws_s3_bucket_policy.this will be created
+ aws_s3_bucket_public_access_block.this will be created
+ aws_s3_bucket_versioning.this will be created
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 5 to add, 0 to change, 0 to destroy.</br>

<!-- placeholder-4 -->
###### By @ruzickap at 2025-01-29T21:26:06Z [(view log)](https://github.com/ruzickap/gha-test/actions/runs/13040745093/job/36381811422#step:5:1).
</summary>

```hcl

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # data.aws_iam_policy_document.administration will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "administration" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteBucket",
              + "s3:DeleteBucketPolicy",
              + "s3:PutBucketPolicy",
              + "s3:PutBucketPublicAccessBlock",
              + "s3:PutBucketTagging",
              + "s3:PutBucketVersioning",
              + "s3:PutEncryptionConfiguration",
              + "s3:PutLifecycleConfiguration",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
            ]
          + sid       = "S3BucketAdministration"

          + condition {
              + test     = "ArnNotEquals"
              + values   = [
                  + "arn:aws:iam::729560437327:role/GitHubOidcFederatedRole",
                ]
              + variable = "aws:PrincipalArn"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # data.aws_iam_policy_document.require_latest_tls will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "require_latest_tls" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "denyOutdatedTLS"

          + condition {
              + test     = "NumericLessThan"
              + values   = [
                  + "1.2",
                ]
              + variable = "s3:TlsVersion"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "ruzickap-test-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = true
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_ownership_controls.this will be created
  + resource "aws_s3_bucket_ownership_controls" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + object_ownership = "BucketOwnerEnforced"
        }
    }

  # aws_s3_bucket_policy.this will be created
  + resource "aws_s3_bucket_policy" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- tofu-302-57bbc6ea48b4c5747d6e7bda69e60d16.tfplan -->
<!-- placeholder-6 -->